onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ГруппаШапкаПраво = ЭтаФорма.Элементы.Найти("ГруппаШапкаПраво");
	ГруппаШапкаЛево = ЭтаФорма.Элементы.Найти("ГруппаШапкаЛево");
	
	НоваяГруппа = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),ГруппаШапкаЛево); 
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	НоваяГруппа.Заголовок = "";
	НоваяГруппа.ОтображатьЗаголовок = Ложь; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	// Добавляем новое поле ввода на форму
	Элемент = ЭтаФорма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), НоваяГруппа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
	Элемент.УстановитьДействие("ПриИзменении","СогласованнаяСкидкаПриИзменении");
	
	// Добавляем новую команду
	Кмд = ЭтаФорма.Команды.Добавить("ПересчетСоСкидкой");
	Кмд.Действие = "КомандаПересчетСоСкидкой";
	Кмд.Заголовок = "Пересчитать таблицу";

	// Добавляем новую кнопку
	Элемент2 = ЭтаФорма.Элементы.Добавить("ПересчетСоСкидкой", Тип("КнопкаФормы"), НоваяГруппа);
	Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент2.ИмяКоманды = "ПересчетСоСкидкой";
	
	
	ПолеВвода = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), ГруппаШапкаПраво);
	ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо"; 
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НоваяСвязь);
	ПолеВвода.СвязиПараметровВЫбора = Новый ФиксированныйМассив(НовыйМассив); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура СогласованнаяСкидкаПриИзменении(Элемент)
//При изменении суммы скидки задаем вопрос о необходимости пересчета
//Дальнейший пересчет в ПересчетСоСкидкой() 

    ВопросПересчет(); 
//--	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	КоэффициентСкидки = ОбщаяСкидка(Объект.СогласованнаяСкидка, 
								  	ТекущиеДанные.Скидка, 
								  	ТекущиеДанные.НомерСтроки, 
								  	ЭтаФорма.ТекущийЭлемент.Имя);

	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	РассчитатьСуммуДокумента();

	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ОбщаяСкидка(СогласованнаяСкидка, СкидкаСтроки, НомерСтроки, ТАбличнаяЧасть = "")
//++расчет общей скидки с проверкой и сообщением  
	КоэффициентСкидки = 1 - (СкидкаСтроки + СогласованнаяСкидка)/ 100;
	Если КоэффициентСкидки < 0 Тогда
		Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "В строке №"+НомерСтроки+"
            			  |Скидка строки: "+Строка(СкидкаСтроки)+"% " + "
            			  | в сумме с согласованной скидкой "+СогласованнаяСкидка+"%" + " 
            			  | превышает 100%";
        ОбъектТабличнаяЧасть = "Объект." + ТАбличнаяЧасть + "["; 
		Сообщение.Поле = ОбъектТабличнаяЧасть + (НомерСтроки-1)+"].Скидка"; 
        Сообщение.Сообщить();
	    КоэффициентСкидки = 0 ;
	КонецЕсли;
    Возврат КоэффициентСкидки;

КонецФункции

&НаКлиенте
Асинх Процедура ВопросПересчет() 
	Если Объект.Товары.Количество() > 0 или   
		 Объект.Услуги.Количество() > 0 тогда 
		ТекстВопроса = "Изменилась сумма скидки. Пересчитать таблицы товаров и услуг?";
		ОтветАсинх = ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет)  ;
		ОТвет = Ждать ОтветАсинх;
		Если ОТвет = КодВозвратаДиалога.Да Тогда
	        ПересчетСоСкидкой();
		КонецЕсли;
    КонецЕсли;								
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетСоСкидкой()
//Вызов пересчета табличных частей с учетом скидки
	ДЗ_ПересчетСоСкидкойСервер("Товары"); 
	ДЗ_ПересчетСоСкидкойСервер("Услуги");
	РассчитатьСуммуДокумента();
//--	
КонецПроцедуры

&НаСервере
Процедура ДЗ_ПересчетСоСкидкойСервер(ИмяТабличнойЧасти)
//пересчет суммы для  отдельной табличной части
	Если ИмяТабличнойЧасти = "Товары" Тогда
		ТабличнаяЧасть = Объект.Товары;
	ИНачеЕсли ИмяТабличнойЧасти = "Услуги" Тогда
		ТабличнаяЧасть = Объект.Услуги;
	ИНаче
		Возврат;
	КонецЕсли;
	Для Каждого Строчка из ТабличнаяЧасть Цикл 
	
	    ОбщаяСкидка = ОбщаяСкидка(Объект.СогласованнаяСкидка, 
								  Строчка.Скидка, 
								  Строчка.НомерСтроки, 
								  ИмяТабличнойЧасти);
		Строчка.Сумма = Строчка.Цена * Строчка.Количество * ОбщаяСкидка;  
		Строчка.Скидка = Строчка.Цена * Строчка.Количество - Строчка.Сумма;
	КонецЦикла;
//--								   
КонецПроцедуры 

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
